
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Перерассчитать(Команда)
	
	ПроведениеРасчетов.ПерерассчитатьНачисления(ПредопределенноеЗначение( "ПланВидовРасчета.ОсновныеНачисления.Оклад"));
	ПроведениеРасчетов.ПерерассчитатьНачисления(ПредопределенноеЗначение( "ПланВидовРасчета.ОсновныеНачисления.Премия")); 

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
