
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.СтоимостьМатериалов.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	Движения.Управленческий.Записывать = Истина;
	
	// создание менеджера временной таблицы
	МенеджерВТ = Новый МенеджерВременныхТаблиц();
	
#Область НоменклатураДокумента

	// Выборка данных из таблицы документа
	Запрос = Новый Запрос;
	
	// Указать, что запрос используется созданным менеджером
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ; 
	
	// Скорректированный текст запроса (получение данных из таблицы документа), созданный ранее 
	// (убрал стоимость- реквизит удален из табличной части, создал временную таблицу)
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура,
		|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ОказаниеУслугиПереченьНоменклатуры.НаборСвойств КАК НаборСвойств,
		|	СУММА(ОказаниеУслугиПереченьНоменклатуры.Количество) КАК КоличествоВДокументе,
		|	СУММА(ОказаниеУслугиПереченьНоменклатуры.Сумма) КАК СуммаВДокументе
		|ПОМЕСТИТЬ НоменклатураДокумента
		|ИЗ
		|	Документ.ОказаниеУслуги.ПереченьНоменклатуры КАК ОказаниеУслугиПереченьНоменклатуры
		|ГДЕ
		|	ОказаниеУслугиПереченьНоменклатуры.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура,
		|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры,
		|	ОказаниеУслугиПереченьНоменклатуры.НаборСвойств";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
#КонецОбласти

#Область ДвиженияДокумента
	
	// Создается второй запрос для получения данных из регистров
	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.Текст =
		"ВЫБРАТЬ
		|	НоменклатураДокумента.Номенклатура,
		|	НоменклатураДокумента.НаборСвойств,
		|	НоменклатураДокумента.ВидНоменклатуры,
		|	НоменклатураДокумента.КоличествоВДокументе,
		|	НоменклатураДокумента.СуммаВДокументе,
		|	ЕСТЬNULL(ОстаткиМатериаловОстатки.КоличествоОстаток, 0) КАК Количество,
		|	ЕСТЬNULL(СтоимостьМатериаловОстатки.СтоимостьОстаток, 0) КАК Стоимость
		|ИЗ
		|	НоменклатураДокумента КАК НоменклатураДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиМатериалов.Остатки(&Период, (Материал, НаборСвойств) В
		|			(ВЫБРАТЬ
		|				НоменклатураДокумента.Номенклатура,
		|				НоменклатураДокумента.НаборСвойств
		|			ИЗ
		|				НоменклатураДокумента)) КАК ОстаткиМатериаловОстатки
		|		ПО НоменклатураДокумента.Номенклатура = ОстаткиМатериаловОстатки.Материал
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьМатериалов.Остатки(&Период, Материал В
		|			(ВЫБРАТЬ
		|				НоменклатураДокумента.Номенклатура
		|			ИЗ
		|				НоменклатураДокумента)) КАК СтоимостьМатериаловОстатки
		|		ПО НоменклатураДокумента.Номенклатура = СтоимостьМатериаловОстатки.Материал";
	
	Запрос2.УстановитьПараметр("Период", МоментВремени());
	
	// Установить необходимость блокировки данных в регистрах СтоимостьМатериалов 
	// и ОстаткиМатериалов.
 	Движения.СтоимостьМатериалов.БлокироватьДляИзменения = Истина;
 	Движения.ОстаткиМатериалов.БлокироватьДляИзменения = Истина;
 
 	РезультатЗапроса = Запрос2.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Стоимость материала равна частному от деления 
		// всей стоимости, полученной запросом (Стоимость), 
		// на общее количество материала на всех складах (Количество).
		Если Выборка.Количество = 0 Тогда
			СтоимостьМатериала = 0;
		Иначе 
			СтоимостьМатериала = Выборка.Стоимость / Выборка.Количество;			
		КонецЕсли;
		
		// Условие, чтобы в регистре остатков отсутсвовали услуги
		Если Выборка.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал Тогда
			
			// регистр ОстаткиМатериалов
			Движение = Движения.ОстаткиМатериалов.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Материал = Выборка.Номенклатура;
			Движение.НаборСвойств = Выборка.НаборСвойств;
			Движение.Склад = Склад;
			Движение.Организация = Организация;
			Движение.Количество = Выборка.КоличествоВДокументе;	
			
			// регистр СтоимостьМатериалов
			Движение = Движения.СтоимостьМатериалов.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Материал = Выборка.Номенклатура;
			Движение.Стоимость = Выборка.КоличествоВДокументе * СтоимостьМатериала;			
		КонецЕсли;
		
		// регистр Продажи
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Клиент = Клиент;
		Движение.Мастер = Мастер;
		Движение.Количество = Выборка.КоличествоВДокументе;
		Движение.Выручка = Выборка.СуммаВДокументе;
		Движение.Стоимость = Выборка.КоличествоВДокументе * СтоимостьМатериала;	
		
		// регистр Управленческий
		// проводка Дт62 - Кр90
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.ДебиторскаяЗадолженность;
		Движение.СчетКт = ПланыСчетов.Основной.Капитал;
		Движение.Период = Дата;
		Движение.Сумма = Выборка.СуммаВДокументе;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Клиенты] = Клиент;
		
		// проводка Дт90 - Кр41
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.Капитал;
		Движение.СчетКт = ПланыСчетов.Основной.Товары;
		Движение.Период = Дата;
		Движение.Сумма = Выборка.СуммаВДокументе;
		Движение.КоличествоКт = Выборка.КоличествоВДокументе;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = Выборка.Номенклатура;		
		
	КонецЦикла;
	
	Движения.Записать();

#КонецОбласти

#Область КонтрольОстатков

	// Контроль остатков
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
	
		Запрос3 = Новый Запрос;
		Запрос3.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос3.Текст = 
			"ВЫБРАТЬ
			|	ОстаткиМатериаловОстатки.Материал,
			|	ОстаткиМатериаловОстатки.НаборСвойств,
			|	ОстаткиМатериаловОстатки.Склад,
			|	ОстаткиМатериаловОстатки.КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.ОстаткиМатериалов.Остатки(, (Материал, НаборСвойств) В
			|		(ВЫБРАТЬ
			|			НоменклатураДокумента.Номенклатура,
			|			НоменклатураДокумента.НаборСвойств
			|		ИЗ
			|			НоменклатураДокумента)
			|	И Склад = &Склад) КАК ОстаткиМатериаловОстатки
			|ГДЕ
			|	ОстаткиМатериаловОстатки.КоличествоОстаток < 0";
		
		Запрос3.УстановитьПараметр("Склад", Склад);	
		
		РезультатЗапроса = Запрос3.Выполнить();		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "На складе " + Выборка.Склад +
				" Не хватает товара " + Выборка.Материал + 
				" в количестве " + Строка(-Выборка.КоличествоОстаток) + " ед.";
			Сообщение.Сообщить();			
		КонецЦикла;
		
	КонецЕсли;
#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
