
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.СтоимостьМатериалов.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	// создание менеджера временной таблицы
	МенеджерВТ = Новый МенеджерВременныхТаблиц();
	
	// Выборка данных из таблицы документа
	Запрос = Новый Запрос;
	
	// Указать, что запрос используется созданным менеджером
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ; 
	
	// Скорректированный текст запроса (получение данных из таблицы документа), созданный ранее 
	// (убрал стоимость- реквизит удален из табличной части, создал временную таблицу)
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура,
		|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	СУММА(ОказаниеУслугиПереченьНоменклатуры.Количество) КАК КоличествоВДокументе,
		|	СУММА(ОказаниеУслугиПереченьНоменклатуры.Сумма) КАК СуммаВДокументе
		|ПОМЕСТИТЬ ВТ_НоменклатураДокумента
		|ИЗ
		|	Документ.ОказаниеУслуги.ПереченьНоменклатуры КАК ОказаниеУслугиПереченьНоменклатуры
		|ГДЕ
		|	ОказаниеУслугиПереченьНоменклатуры.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура,
		|	ОказаниеУслугиПереченьНоменклатуры.Номенклатура.ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Создается второй запрос для получения данных из регистров
	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.Текст =
		"ВЫБРАТЬ
		|	ВТ_НоменклатураДокумента.Номенклатура,
		|	ВТ_НоменклатураДокумента.ВидНоменклатуры,
		|	ВТ_НоменклатураДокумента.КоличествоВДокументе,
		|	ВТ_НоменклатураДокумента.СуммаВДокументе,
		|	ЕСТЬNULL(ОстаткиМатериаловОстатки.КоличествоОстаток, 0) КАК Количество,
		|	ЕСТЬNULL(СтоимостьМатериаловОстатки.СтоимостьОстаток, 0) КАК Стоимость
		|ИЗ
		|	ВТ_НоменклатураДокумента КАК ВТ_НоменклатураДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиМатериалов.Остатки(&Период, Материал В
		|			(ВЫБРАТЬ
		|				ВТ_НоменклатураДокумента.Номенклатура
		|			ИЗ
		|				ВТ_НоменклатураДокумента)) КАК ОстаткиМатериаловОстатки
		|		ПО ВТ_НоменклатураДокумента.Номенклатура = ОстаткиМатериаловОстатки.Материал
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьМатериалов.Остатки(&Период, Материал В
		|			(ВЫБРАТЬ
		|				НоменклатураДокумента.Номенклатура
		|			ИЗ
		|				НоменклатураДокумента)) КАК СтоимостьМатериаловОстатки
		|		ПО ВТ_НоменклатураДокумента.Номенклатура = СтоимостьМатериаловОстатки.Материал";
	
	Запрос2.УстановитьПараметр("Период", МоментВремени());
	
	Выборка = Запрос2.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Условие, чтобы в регистре остатков отсутсвовали услуги
		Если Выборка.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал Тогда
			
			// регистр ОстаткиМатериалов
			Движение = Движения.ОстаткиМатериалов.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Материал = Выборка.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = Выборка.КоличествоВДокументе;	
			
			// регистр СтоимостьМатериалов
			Движение = Движения.СтоимостьМатериалов.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Материал = Выборка.Номенклатура;
			Движение.Стоимость = Выборка.КоличествоВДокументе * Выборка.Стоимость;			
		КонецЕсли;
		
		// регистр Продажи
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Клиент = Клиент;
		Движение.Мастер = Мастер;
		Движение.Количество = Выборка.КоличествоВДокументе;
		Движение.Выручка = Выборка.СуммаВДокументе;
		Движение.Стоимость = Выборка.КоличествоВДокументе * Выборка.Стоимость;	
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
