
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция УстановкаЗакупочнойЦены(АктуальнаяДата, Номенклатура) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура);
	
	ЗначениеРесурса = РегистрыСведений.ЦеныЗакупок.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	Возврат ЗначениеРесурса.ЦенаЗакупки;
	
КонецФункции

Функция ОтпускнаяЦена(АктуальнаяДата, Номенклатура) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура);
	
	ЗначениеРесурса = РегистрыСведений.ЦеныПродажиНоменклатуры.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	Возврат ЗначениеРесурса.Цена;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций
 
#КонецОбласти
