
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ЦеныЗакупок
	Движения.ЦеныЗакупок.Записывать = Истина;
	Для Каждого ТекСтрокаЗакупкаНоменклатуры из ЗакупкаНоменклатуры Цикл
		Движение = Движения.ЦеныЗакупок.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаЗакупкаНоменклатуры.Номенклатура;
		Движение.ЦенаЗакупки = ТекСтрокаЗакупкаНоменклатуры.ЦенаЗакупки;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
