
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ЦеныПродажиНоменклатуры
	Движения.ЦеныПродажиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаЦеныПродажНоменклатуры из ЦеныПродажНоменклатуры Цикл
		Движение = Движения.ЦеныПродажиНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаЦеныПродажНоменклатуры.Номенклатура;
		Движение.Цена = ТекСтрокаЦеныПродажНоменклатуры.Цена;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗакупочныеЦены") Тогда
		// Заполнение шапки
		Для Каждого ТекСтрокаЗакупкаНоменклатуры из ДанныеЗаполнения.ЗакупкаНоменклатуры Цикл
			НоваяСтрока = ЦеныПродажНоменклатуры.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрокаЗакупкаНоменклатуры.Номенклатура;
			НоваяСтрока.Цена = ТекСтрокаЗакупкаНоменклатуры.ЦенаЗакупки;
		КонецЦикла;
	КонецЕсли;

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ

КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
