
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ПриНачалеРаботыСистемы()
	
	КлиентскоеПриложение.УстановитьКраткийЗаголовок("Александр Е");
	
	ПредупредитьОНачалеРабочегоДня();	
		
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПредупредитьОНачалеРабочегоДня()
	
	//@skip-check use-non-recommended-method
	Если ДеньНедели(ТекущаяДата()) < 6 Тогда
		ПоказатьОповещениеПользователя("Сегодня рабочий день");
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти
