
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Материалы.ТекущиеДанные;	
	РаботаСДокументамиКлиент.РасчетСуммыПоСтроке(СтрокаТЧ);
		
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)	
	СтрокаТЧ = Элементы.Материалы.ТекущиеДанные;	
	РаботаСДокументамиКлиент.РасчетСуммыПоСтроке(СтрокаТЧ);
	
КонецПроцедуры


&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Материалы.ТекущиеДанные;
	СтрокаТЧ.Цена = РаботаСоСправочникамиСервер.УстановкаЗакупочнойЦены(Объект.Дата, СтрокаТЧ.Материал);
	РаботаСДокументамиКлиент.РасчетСуммыПоСтроке(СтрокаТЧ);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
